---
kind: property
id: P:Autodesk.Revit.DB.PointClouds.PointIterator.Current
source: html/9fd2626f-2cb8-15bb-b2dc-779822179d12.htm
---
# Autodesk.Revit.DB.PointClouds.PointIterator.Current Property

## Syntax (C#)
```csharp
public virtual CloudPoint Current { get; }
```